// local let ทำงานใน function
// global var ทำงานนอก function

let k = 5;
{
  var x = 10;
  let y = 20;
  const z = 30;
}
console.log(x); // ใช้ได้
// console.log(y); // ใช้ไม่ได้ เพราะอยู่นอก scope

// จากตัวอย่างข้างบน จะเห็นว่า ตัวแปร x ใช้ได้ แต่ตัวแปร y ใช้ไม่ได้ เพราะอยู่นอก scope
// และตัวแปร z ใช้ไม่ได้เช่นกัน เพราะเป็นค่าคงที่

// ความต่างระหว่าง var, let และ const
// var สามารถใช้งานได้ทั่วไป และสามารถประกาศซ้ำได้
// let สามารถใช้งานได้ใน scope ที่ประกาศ และไม่สามารถประกาศซ้ำได้
// const สามารถใช้งานได้ใน scope ที่ประกาศ และไม่สามารถประกาศซ้ำได้ และไม่สามารถเปลี่ยนค่าได้
